The  DimensionEqualityLabelFormatting  type exposes the following members.
 Methods
Name  |   Description
Dispose
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetFormatOptions
 Gets format Options
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsValidFormatOptions
 Checks whether a FormatOptions object is valid for the LabelType.
SetFormatOptions
 Sets format Options
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  DimensionEqualityLabelFormatting Class
  Autodesk.Revit.DB Namespace